# Chapter 7

In [2]:
import pandas as pd
import numpy as np
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [5]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [6]:
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [7]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],[np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [12]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = np.nan

In [16]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -0.983545       NaN       NaN
1 -1.850526       NaN       NaN
2 -0.201209       NaN  1.458367
3 -0.018042       NaN  0.546437
4 -0.764035 -1.126715  0.693091
5  0.539928 -0.324780  0.390983
6  1.777670  0.507078 -1.277465

In [18]:
df.dropna()

          0         1         2
4 -0.764035 -1.126715  0.693091
5  0.539928 -0.324780  0.390983
6  1.777670  0.507078 -1.277465

In [19]:
df.dropna(thresh=2)

          0         1         2
2 -0.201209       NaN  1.458367
3 -0.018042       NaN  0.546437
4 -0.764035 -1.126715  0.693091
5  0.539928 -0.324780  0.390983
6  1.777670  0.507078 -1.277465

In [20]:
df.fillna(0)

          0         1         2
0 -0.983545  0.000000  0.000000
1 -1.850526  0.000000  0.000000
2 -0.201209  0.000000  1.458367
3 -0.018042  0.000000  0.546437
4 -0.764035 -1.126715  0.693091
5  0.539928 -0.324780  0.390983
6  1.777670  0.507078 -1.277465

In [21]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.983545  0.500000  0.000000
1 -1.850526  0.500000  0.000000
2 -0.201209  0.500000  1.458367
3 -0.018042  0.500000  0.546437
4 -0.764035 -1.126715  0.693091
5  0.539928 -0.324780  0.390983
6  1.777670  0.507078 -1.277465

In [22]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

df.iloc[2:, 1] = np.nan

df.iloc[4:, 2] = np.nan

df

          0         1         2
0 -0.511287 -1.430567  0.480569
1 -0.493792  1.661112  0.069131
2  0.962969       NaN -2.519160
3  0.387496       NaN  0.280248
4 -0.177161       NaN       NaN
5 -0.088382       NaN       NaN

In [23]:
df.fillna(method="ffill")

          0         1         2
0 -0.511287 -1.430567  0.480569
1 -0.493792  1.661112  0.069131
2  0.962969  1.661112 -2.519160
3  0.387496  1.661112  0.280248
4 -0.177161  1.661112  0.280248
5 -0.088382  1.661112  0.280248

In [24]:
df.fillna(method="ffill", limit=2)

          0         1         2
0 -0.511287 -1.430567  0.480569
1 -0.493792  1.661112  0.069131
2  0.962969  1.661112 -2.519160
3  0.387496  1.661112  0.280248
4 -0.177161       NaN  0.280248
5 -0.088382       NaN  0.280248

In [25]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [26]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
"k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [27]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [28]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [31]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [32]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [33]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [34]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon","pastrami", "corned beef", "bacon","pastrami", "honey ham", "nova lox"],"ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [35]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [36]:
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [37]:
def get_animal(x):
    return meat_to_animal[x]
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [38]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [39]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [40]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [41]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=["Ohio", "Colorado", "New York"],
columns=["one", "two", "three", "four"])

In [42]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [43]:
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [44]:
data.index = data.index.map(transform)

data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [45]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [46]:
bins = [18, 25, 35, 60, 100]

age_categories = pd.cut(ages, bins)

age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [47]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [48]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [49]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [50]:
pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [51]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [52]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [53]:
data = np.random.uniform(size=20)

pd.cut(data, 4, precision=2)

[(0.0059, 0.25], (0.5, 0.75], (0.25, 0.5], (0.0059, 0.25], (0.0059, 0.25], ..., (0.5, 0.75], (0.0059, 0.25], (0.0059, 0.25], (0.75, 0.99], (0.5, 0.75]]
Length: 20
Categories (4, interval[float64, right]): [(0.0059, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 0.99]]

In [54]:
data = np.random.standard_normal(1000)

quartiles = pd.qcut(data, 4, precision=2)

quartiles

[(-3.19, -0.66], (0.69, 2.93], (-0.03, 0.69], (-0.03, 0.69], (-0.03, 0.69], ..., (-0.03, 0.69], (-3.19, -0.66], (-3.19, -0.66], (0.69, 2.93], (-0.03, 0.69]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.19, -0.66] < (-0.66, -0.03] < (-0.03, 0.69] < (0.69, 2.93]]

In [55]:
pd.value_counts(quartiles)

(-3.19, -0.66]    250
(-0.66, -0.03]    250
(-0.03, 0.69]     250
(0.69, 2.93]      250
dtype: int64

In [56]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.179, -1.241]     100
(-1.241, -0.0297]    400
(-0.0297, 1.356]     400
(1.356, 2.929]       100
dtype: int64

In [57]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.044297    -0.062695    -0.031414     0.029864
std       1.001851     1.000350     1.015346     1.020599
min      -2.785058    -2.914523    -3.050748    -3.113619
25%      -0.729336    -0.757660    -0.679049    -0.670951
50%      -0.040589    -0.053634    -0.019624     0.038351
75%       0.660946     0.609841     0.661674     0.743379
max       3.190643     2.963471     3.584761     3.039919

In [58]:
col = data[2]

col[col.abs() > 3]

23    -3.050748
27    -3.044742
308    3.584761
810    3.033863
960    3.008200
Name: 2, dtype: float64

In [59]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
23  -1.035986  0.731183 -3.050748  1.255810
27   0.682415  0.345836 -3.044742  0.875051
198  3.190643  0.377006 -0.045120  0.478456
308 -0.243517 -1.715626  3.584761 -1.600119
499  0.466371 -0.399624  0.532846 -3.113619
561  0.777563 -0.390357 -0.839694  3.039919
810 -0.364864  0.513238  3.033863 -0.322064
960 -0.398368  0.958016  3.008200  1.244436

In [60]:
data[data.abs() > 3] = np.sign(data) * 3

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.044488    -0.062695    -0.031945     0.029937
std       1.001253     1.000350     1.013019     1.020138
min      -2.785058    -2.914523    -3.000000    -3.000000
25%      -0.729336    -0.757660    -0.679049    -0.670951
50%      -0.040589    -0.053634    -0.019624     0.038351
75%       0.660946     0.609841     0.661674     0.743379
max       3.000000     2.963471     3.000000     3.000000

In [61]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1  1.0 -1.0  1.0  1.0
2 -1.0  1.0 -1.0  1.0
3  1.0  1.0 -1.0 -1.0
4 -1.0 -1.0 -1.0  1.0

In [64]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [65]:
sampler = np.random.permutation(5)

In [66]:
df.take(sampler)

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
0   0   1   2   3   4   5   6

In [67]:
df.iloc[sampler]

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
0   0   1   2   3   4   5   6

In [68]:
df.sample(n=3)

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20

In [69]:
choices = pd.Series([5, 7, -1, 6, 4])

choices.sample(n=10, replace=True)

4    4
3    6
0    5
1    7
2   -1
4    4
0    5
1    7
0    5
4    4
dtype: int64

In [70]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})

In [71]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [72]:
pd.get_dummies(df["key"])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [73]:
dummies = pd.get_dummies(df["key"], prefix="key")

In [74]:
df_with_dummy = df[["data1"]].join(dummies)

In [75]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [76]:
mnames = ["movie_id", "title", "genres"]""

In [78]:
movies = pd.read_table("datasets/movielens/movies.dat", sep="::", header=None, names=mnames, engine="python")

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/movielens/movies.dat'

NameError: name 'movies' is not defined

In [80]:
np.random.seed(12345) # to make the example repeatable

values = np.random.uniform(size=10)

values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [81]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [82]:
s = pd.Series([1, 2, 3, None])

In [83]:
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [84]:
s.dtype

dtype('float64')

In [85]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())

In [86]:
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [87]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [88]:
s.dtype

Int64Dtype()

In [89]:
s[3]

In [90]:
s[3] is pd.NA

True

In [91]:
s = pd.Series([1, 2, 3, None], dtype="Int64")

In [92]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())

In [93]:
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [94]:
df = pd.DataFrame({"A": [1, 2, None, 4],
"B": ["one", "two", "three", None],
 "C": [False, None, False, True]})

df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [95]:
df["A"] = df["A"].astype("Int64")

df["B"] = df["B"].astype("string")

df["C"] = df["C"].astype("boolean")

df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

In [96]:
val = "a,b,  guido"

In [97]:
val.split(",")

['a', 'b', '  guido']

In [98]:
pieces = [x.strip() for x in val.split(",")]

In [99]:
pieces

['a', 'b', 'guido']

In [100]:
first, second, third = pieces

In [101]:
first + "::" + second + "::" + third

'a::b::guido'

In [102]:
"::".join(pieces)

'a::b::guido'

In [103]:
"guido" in val

True

In [104]:
val.index(",")

1

In [105]:
val.find(":")

-1

In [106]:
val.index(":")

ValueError: substring not found

In [107]:
val.count(",")

2

In [108]:
val.replace(",", "::")

'a::b::  guido'

In [109]:
val.replace(",", "")

'ab  guido'

In [110]:
import re
text = "foo    bar\t baz  \tqux"

In [111]:
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [112]:
regex = re.compile(r"\s+")

In [113]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [114]:
regex.findall(text)

['    ', '\t ', '  \t']

In [115]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

In [116]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [117]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [118]:
m = regex.search(text)

In [119]:
m

In [120]:
text[m.start():m.end()]

'dave@google.com'

In [121]:
print(regex.match(text))

None

In [122]:
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [123]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

regex = re.compile(pattern, flags=re.IGNORECASE)

In [124]:
m = regex.match("wesm@bright.net")

m.groups()

('wesm', 'bright', 'net')

In [125]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [127]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [128]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
"Rob": "rob@gmail.com", "Wes": np.nan}

data = pd.Series(data)

data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [129]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [130]:
data_as_string_ext = data.astype('string')

data_as_string_ext

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [131]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

In [193]: data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [132]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]

In [133]:
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [134]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [135]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [136]:
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

In [137]:
values = pd.Series(['apple', 'orange', 'apple',
'apple'] * 2)

In [138]:
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [139]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [140]:
pd.value_counts(values)

apple     6
orange    2
dtype: int64

In [141]:
values = pd.Series([0, 1, 0, 0] * 2)

In [142]:
dim = pd.Series(['apple', 'orange'])

In [143]:
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [144]:
dim

0     apple
1    orange
dtype: object

In [145]:
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [146]:
fruits = ['apple', 'orange', 'apple', 'apple'] * 2

In [147]:
N = len(fruits)

rng = np.random.default_rng(seed=12345)

df = pd.DataFrame({'fruit': fruits,
'basket_id': np.arange(N),
'count': rng.integers(3, 15, size=N),
'weight': rng.uniform(0, 4, size=N)},
columns=['basket_id', 'fruit', 'count', 'weight'])

df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [148]:
fruit_cat = df['fruit'].astype('category')

In [149]:
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [150]:
c = fruit_cat.array

In [151]:
type(c)

pandas.core.arrays.categorical.Categorical

In [152]:
c.categories

Index(['apple', 'orange'], dtype='object')

In [153]:
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [154]:
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [155]:
df["fruit"]

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: object

In [156]:
my_categories = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])

In [157]:
my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [158]:
categories = ['foo', 'bar', 'baz']

codes = [0, 1, 2, 0, 0, 1]

my_cats_2 = pd.Categorical.from_codes(codes, categories)

my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [159]:
ordered_cat = pd.Categorical.from_codes(codes, categories,
ordered=True)

ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [160]:
rng = np.random.default_rng(seed=12345)

In [161]:
draws = rng.standard_normal(1000)

In [162]:
draws[:5]

array([-1.42382504,  1.26372846, -0.87066174, -0.25917323, -0.07534331])

In [163]:
bins = pd.qcut(draws, 4)

In [164]:
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [165]:
bins = pd.qcut(draws, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])
bins

['Q1', 'Q4', 'Q1', 'Q2', 'Q2', ..., 'Q3', 'Q3', 'Q2', 'Q3', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [168]:
bins = pd.Series(bins, name='quartile')

results = (pd.Series(draws).groupby(bins).agg(['count', 'min', 'max']).reset_index())

results

  quartile  count       min       max
0       Q1    250 -3.119609 -0.678494
1       Q2    250 -0.673305  0.008009
2       Q3    250  0.018753  0.686183
3       Q4    250  0.688282  3.211418

In [169]:
results['quartile']

0    Q1
1    Q2
2    Q3
3    Q4
Name: quartile, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [170]:
N = 10_000_000

labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N // 4))

In [171]:
categories = labels.astype('category')

In [172]:
labels.memory_usage(deep=True)

600000128

In [173]:
categories.memory_usage(deep=True)

10000540

In [174]:
%time _ = labels.astype('category')

CPU times: user 345 ms, sys: 6.34 ms, total: 352 ms
Wall time: 349 ms

In [175]:
%timeit labels.value_counts()

329 ms  1.95 ms per loop (mean  std. dev. of 7 runs, 1 loop each)

In [176]:
%timeit categories.value_counts()

16.7 ms  117 s per loop (mean  std. dev. of 7 runs, 100 loops each)

In [177]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)

In [178]:
cat_s = s.astype('category')

In [179]:
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [180]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [181]:
actual_categories = ['a', 'b', 'c', 'd', 'e']

cat_s2 = cat_s.cat.set_categories(actual_categories)

cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [182]:
cat_s.value_counts()

a    2
b    2
c    2
d    2
dtype: int64

In [183]:
cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
dtype: int64

In [184]:
cat_s3 = cat_s[cat_s.isin(['a', 'b'])]

In [185]:
cat_s3

0    a
1    b
4    a
5    b
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [186]:
cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

In [187]:
cat_s = pd.Series(['a', 'b', 'c', 'd'] * 2, dtype='category')

In [188]:
pd.get_dummies(cat_s)

   a  b  c  d
0  1  0  0  0
1  0  1  0  0
2  0  0  1  0
3  0  0  0  1
4  1  0  0  0
5  0  1  0  0
6  0  0  1  0
7  0  0  0  1